In [ ]:
check1 = 1

check2 = 0

check3 = 0

check4 = 1

In [ ]:
print(bool(check1))
print(bool(check2))
print(bool(check3))
print(bool(check4))

In [ ]:
'''
사용자에게 나이(변수명 : age)를 입력받은 후, 아래의 운임요금(변수명 : fare) 기준에 맞게 버스 요금을 계산해주세요.

7세 이하 : 0원

8세 이상 ~ 20세 이하 : 700원

21세 이상 : 1200원

 

age = int(input('나이를 입력하세요'))

fare = 0

# 코드 작성

 

'버스요금은 {}원 입니다.'.format(fare)
'''

In [ ]:
age = int(input('나이를 입력하세요'))
fare = 0
if(age<=7):
    fare = 0
elif(age<=20):
    fare = 700
else:
    fare = 1200
print('버스요금은 {}원 입니다.'.format(fare))

In [ ]:
'''accounts 라는 딕셔너리의 잔액 (value) 을 total 이라는 변수에 모두 더하여 출력해주세요.

 

accounts = {"A계좌": 2322000, "B계좌": 34443000, "C계좌": 6888000}

# 코드 작성란

total = 0

 

# 출력

print(total)
'''

In [ ]:
accounts = {"A계좌": 2322000, "B계좌": 34443000, "C계좌": 6888000}
total = 0
values_accounts = list(accounts.values())
for i in values_accounts :
    total +=i
print(total)

In [ ]:
'''
	
아래 리스트 요소 중에 '음수' 가 있다면 0 으로 바꿔주는 코드를 List Comprehension 으로 작성하시오.

 

numbers = [100, 200, -100, -50, 400, 700]

# 코드 작성

 

# 출력

print(results)

[100, 200, 0, 0, 400, 700]
'''

In [ ]:
numbers = [100, 200, -100, -50, 400, 700]
result = [ v if v > 0 else abs(v) for v in numbers]
print(result)

In [ ]:
'''
아래 함수를 lambda 함수로 구현하시오.

 

def add(num):

  return num + 10

print(add(5))

 

# 코드 작성

 

print(add_lambda(5))

15
'''

In [ ]:
add_lambda = lambda x : x+10
print(add_lambda(5))

In [ ]:
'''
아래 함수 "더하기", "곱하기" 를 계산해주는 함수를 callback function 으로 구현

 

def calc(option, num1 = 100, num2 = 100):

    if option == "더하기":

      total = num1 + num2

  elif option == "곱하기":

    total = num1 * num2

return total

 

* "더하기" 는 add(), "곱하기" 는 mul() 라는 이름의 함수로 생성

* 실제 사용자가 더하기 혹은 곱하기 계산을 시키기 위해 사용할 함수 이름은 calc()

* 위 샘플 함수처럼 숫자값을 입력하지 않으면 기본적으로 각각 100 을 할당

 

# 출력 예)

calc(add)

200

 

calc(mul, 3, 3)

9

'''

In [10]:
def calc(func,a=100,b=100):    
    return func(a,b)
def add(a,b):
    return a+b
def mul(a,b):
    return a*b

In [13]:
calc(add)
calc(mul,3,3)

9

In [7]:
n=3
i=1
total = 0
while n<=100:
    n=i*3
    if n%2:
        print(n, end=' ')
        total += n
    i += 1
print('')
print('누적합은 {}입니다.'.format(total))

3 9 15 21 27 33 39 45 51 57 63 69 75 81 87 93 99
누적합은 867입니다.

In [8]:
10%2

0

'''
'''text = '''안녕하세요, 반갑습니다.

모두 열심히 공부하고 계시죠?

다들 좋은 결과 있길 바래요.'''

 

출력예)

안녕하세요,

반갑습니다.

모두

열심히

공부하고

계시죠?

다들

좋은

결과

있길

바래요.

단어 개수:11
'''

In [36]:
text = '''안녕하세요, 반갑습니다.

모두 열심히 공부하고 계시죠?

다들 좋은 결과 있길 바래요.'''
type(text)

str

In [54]:
word = []
word_split = []
word_enter=text.split('\n\n')
idx = 0
for v in word_enter:
    word_split.append(v.split(' '))
    for i in word_split[idx]:
        word.append(i)
    idx +=1
for v in word:
    print(v)
print("단어 개수:",len(word))

안녕하세요,
반갑습니다.
모두
열심히
공부하고
계시죠?
다들
좋은
결과
있길
바래요.
단어 개수: 11

아래 DataFrame 에서 3번째 행 을 출력하는 코드를 작성하시오.

 

import pandas as pd

df = pd.DataFrame({

    'Name': ['Huh', 'Jo', 'Park', 'Maeng'],

    'Date': [pd.Timestamp('20130102'), pd.Timestamp('20170612'), pd.Timestamp('20180311'), pd.Timestamp('20191022')],

    'Email': ['huh@gmail.com', 'jojo@daum.net', 'park@naver.com', 'maeng@hotmail.com'],

    'Score': [70, 99, 66, 43]                                                                 

})

 

 

# 출력예

Name Park

Date 2018-03-11 00:00:00

Email park@naver.com

Score 66

Name: 2, dtype: object

In [73]:
import pandas as pd

df = pd.DataFrame({

    'Name': ['Huh', 'Jo', 'Park', 'Maeng'],

    'Date': [pd.Timestamp('20130102'), pd.Timestamp('20170612'), pd.Timestamp('20180311'), pd.Timestamp('20191022')],

    'Email': ['huh@gmail.com', 'jojo@daum.net', 'park@naver.com', 'maeng@hotmail.com'],

    'Score': [70, 99, 66, 43]                                                                 

})

In [116]:
df

    Name       Date              Email  Score
0    Huh 2013-01-02      huh@gmail.com     70
1     Jo 2017-06-12      jojo@daum.net     99
2   Park 2018-03-11     park@naver.com     66
3  Maeng 2019-10-22  maeng@hotmail.com     43

In [117]:
df.iloc[2]

Name                    Park
Date     2018-03-11 00:00:00
Email         park@naver.com
Score                     66
Name: 2, dtype: object

In [121]:
import pandas as pd

score_dict = {

  "Name": ["A", "B", "B", "A", "A", "A", "B"],

  "Score": [30, 60, 70, 40, 80, 20, 75]

}

df_score = pd.DataFrame(score_dict)

In [132]:
df_score

  Name  Score
0    A     30
1    B     60
2    B     70
3    A     40
4    A     80
5    A     20
6    B     75

In [140]:
A = df_score[df_score.Name == 'A']
B = df_score[df_score.Name == 'B']

In [144]:
A_avg = A['Score'].mean()
B_avg = B['Score'].mean()
Avg_dict = {

  "Name": ["A", "B"],

  "Score": [A_avg, B_avg]

}
df_avg = pd.DataFrame(Avg_dict)

In [145]:
df_avg

  Name      Score
0    A  42.500000
1    B  68.333333

In [137]:
import pandas as pd
data = {'name': ['Oliver', 'Harry', 'George', 'Noah'],
        'percentage': [90, 99, 50, 65],
        'grade': [88, 76, 95, 79]}
df = pd.DataFrame(data)

In [138]:
df

     name  percentage  grade
0  Oliver          90     88
1   Harry          99     76
2  George          50     95
3    Noah          65     79